# --- カメラの内部パラメータの定義 ---
# fx = 675.508479333196
# fy = 674.936608139554

# --- 以下にf値の近似式の係数を記す ---
# y = a*x**6 + b*x**5 + c*x**4 + d*x**3 + e*x**2 + f*x + g
a = 3.6884E-14
b = -1.52853E-10
c = 2.57674E-07
d = -0.000225456
e = 0.107899161
f = -26.39607535
g = 3264.428615
# !-- 以下にf値の近似式の係数を記す --!

def f(double x):
    return a*x**6 + b*x**5 + c*x**4 + d*x**3 + e*x**2 + f*x + g 

Cx = 1633.39414024524
Cy = 1218.19031757266
# !-- カメラの内部パラメータの定義 --!

# 撮像回数
numOfImgTaken = 5

# --- 天井までの高さ ---
# h1[cm] : 床から天井まで
h1 = 105

# h2[cm] : 床からカメラまで
h2 = 2.2

# h [cm] : カメラから天井まで
h = h1 - h2
# !-- 天井までの高さ --!